БухЭксп/InformationRegisters/CW_ОбработчикиОбновления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбработчикиОбновления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОбработчиковОбновления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РежимыВыполненияОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачальноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриКаждомОбновлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_РежимыВыполненияОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РежимыВыполненияОбработчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оперативно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложенно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыОбработчиковОбновления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыОбработчиковОбновления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнялся</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonForms/CW_РезультатОбновления/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаименованиеКонфигурации = CW_ВерсииПодсистемСервер.ИмяТекущейКонфигурации();
	ЭтаФорма.Заголовок 								= "Результаты обновления модуля " + НаименованиеКонфигурации; 
	Элементы.ГруппаОбновлениеКонфигурации.Заголовок = "Обновление конфигурации модуля "+НаименованиеКонфигурации;
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.CW_ОтложенноеВыполнениеОбработчиковОбновления);  
	РасписаниеЗадания 	= РегламентноеЗадание.Расписание;    
	
	Параметры.Свойство("СтартРегламентногоЗадания", СтартРегламентногоЗадания);
	
	ПроверитьВыполнениеЗадания = Истина; 
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПолучениеИнформации;
	ПолучитьРезультатыОбновления();
	ПолучитьДанныеОтложенногоВыполнения();
	
	Если СтартРегламентногоЗадания = истина Тогда
		CW_ОбновлениеКонфигурацииСервер.УстановитьИспользованиеОтложенногоВыпоненияОбработок();
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПроверитьВыполнениеЗадания Тогда 
		ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ПолучитьРезультатыОбновления()
	
	ВерсияПодсистемы = "0.0.0.0";
	ИмяОсновнойПодсистемы = CW_ВерсииПодсистемСервер.ИмяОсновнойПодсистемы();   
	
	ВерсииПодсистем = CW_ВерсииПодсистемСервер.УстановленныеВерсииПодсистем(); 
	ВерсииПодсистем.Свойство(ИмяОсновнойПодсистемы, ВерсияПодсистемы); 
	
	ШаблонЗаголовка = 	"Выполнено обновления конфигурации на версию %1";

	Элементы.ДекорацияТекстОбновления.Заголовок = СтрШаблон(ШаблонЗаголовка, ВерсияПодсистемы);
	
	ШаблонЗаголовка = "Выполняются дополнительные процедуры обработки данных на версию %1
					   |Работа с этими данными временно ограничена.";
	Элементы.ДекорацияТекстДополнительныеОбработчикиВыполняются.Заголовок = СтрШаблон(ШаблонЗаголовка, ВерсияПодсистемы); 
	
КонецПроцедуры  

&НаСервере
Процедура ПолучитьДанныеОтложенногоВыполнения()  
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ОбработчикиОбновления.ИмяОбработчика КАК ИмяОбработчика
	               |ИЗ
	               |	РегистрСведений.CW_ОбработчикиОбновления КАК CW_ОбработчикиОбновления
	               |ГДЕ
	               |	CW_ОбработчикиОбновления.РежимВыполнения = ЗНАЧЕНИЕ(Перечисление.CW_РежимыВыполненияОбработчиков.Отложенно)";
	
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой() Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбработчикиНеПредусморены; 
		ПроверитьВыполнениеЗадания = Ложь; 
	КонецЕсли;    
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьИнформациюПоОбработчикам() 
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА CW_ОбработчикиОбновления.Статус = ЗНАЧЕНИЕ(Перечисление.CW_СтатусыОбработчиковОбновления.Выполнен)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СтатусВыполнено,
	               |	СУММА(1) КАК СтатусВсего
	               |ИЗ
	               |	РегистрСведений.CW_ОбработчикиОбновления КАК CW_ОбработчикиОбновления
	               |ГДЕ
	               |	CW_ОбработчикиОбновления.РежимВыполнения = ЗНАЧЕНИЕ(Перечисление.CW_РежимыВыполненияОбработчиков.Отложенно)
	               |	И CW_ОбработчикиОбновления.Версия = &Версия";   
	
	Запрос.УстановитьПараметр("Версия", ВерсияПодсистемы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	// если нет обработчиков для выполнения, то группу отложенных обработчиков не показываем
	Если Выборка.СтатусВсего = 0 или Выборка.СтатусВсего = Null Тогда 
		Элементы.ГруппаРегламентноеЗадение.Видимость = Ложь; 
	Иначе
		Элементы.ГруппаРегламентноеЗадение.Видимость = Истина; 
		ШаблонЗаголовка = "Выполнено: %1 из %2"; 
		
		СтрЗаголовк 	= СтрШаблон(ШаблонЗаголовка, Формат(Выборка.СтатусВыполнено,"ЧН=0; ЧГ=0"), Формат(Выборка.СтатусВсего,"ЧН=0; ЧГ=0"));
		
		Элементы.ИнформацияСтатусОбновления.Заголовок  = СтрЗаголовк;
		Элементы.ИнформацияСтатусОбновления1.Заголовок = СтрЗаголовк;
		Элементы.ИнформацияСтатусОбновления2.Заголовок = СтрЗаголовк;  
		Элементы.ИнформацияСтатусОбновления3.Заголовок = СтрЗаголовк;  
		
		ПоказатьКоманду = (Выборка.СтатусВыполнено <> Выборка.СтатусВсего);
		
		Элементы.КомандаВыполнитьСейчас.Видимость 	= ПоказатьКоманду; 
		Элементы.КомандаВыполнитьСейчас1.Видимость 	= ПоказатьКоманду; 
		Элементы.КомандаВыполнитьСейчас2.Видимость 	= ПоказатьКоманду; 
	КонецЕсли;
		
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыполнениеЗадания()
	
	ПроверитьВыполнениеЗадания = Ложь;
	ПроверитьВыполнениеЗаданияНаСервере();	
	Если ПроверитьВыполнениеЗадания Тогда  
		ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания", 2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВыполнениеЗаданияНаСервере()
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.CW_ОтложенноеВыполнениеОбработчиковОбновления);
	
	Отбор = Новый Структура;
	Отбор.Вставить("РегламентноеЗадание", РегламентноеЗадание);
	
	ЗаданияПолучены =  ПолучитьФоновыеЗадания(Отбор);  
	Если НЕ ЗаданияПолучены Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбработчикиНеВыполнялись; 
		УстановитьИнформациюПоОбработчикам();  
		Возврат;
	КонецЕсли;  
	
	Отбор = Новый Структура;
	Отбор.Вставить("РегламентноеЗадание", 	РегламентноеЗадание);
	Отбор.Вставить("Состояние", 			СостояниеФоновогоЗадания.Активно); 
	
	ЗаданияПолучены =  ПолучитьФоновыеЗадания(Отбор);  
	Если ЗаданияПолучены Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбработчикиВыполняются; 
		ПроверитьВыполнениеЗадания = Истина;
	КонецЕсли;   
	
	Если Не ЗаданияПолучены Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("РегламентноеЗадание", 	РегламентноеЗадание);
		Отбор.Вставить("Состояние", 			СостояниеФоновогоЗадания.ЗавершеноАварийно); 
		
		ЗаданияПолучены =  ПолучитьФоновыеЗадания(Отбор);  
		Если ЗаданияПолучены Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбработчикиВыполненыСОшибками; 
		КонецЕсли;   
	КонецЕсли; 	
	
	Если Не ЗаданияПолучены Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("РегламентноеЗадание", 	РегламентноеЗадание);
		Отбор.Вставить("Состояние", 			СостояниеФоновогоЗадания.Завершено); 
		
		ЗаданияПолучены =  ПолучитьФоновыеЗадания(Отбор);   
		Если ЗаданияПолучены Тогда 
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбработчикиЗавершены; 
		КонецЕсли;   
	КонецЕсли; 	 
	
	УстановитьИнформациюПоОбработчикам();  
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьФоновыеЗадания(Отбор)
	
	МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор); 
	Возврат МассивЗаданий.Количество() > 0; 

КонецФункции

&НаКлиенте
Процедура ИнформацияСтатусОбновленияНажатие(Команда)
	
	СтруктураОтбора = новый Структура;
	СтруктураОтбора.Вставить("Версия",			ВерсияПодсистемы);
	СтруктураОтбора.Вставить("РежимВыполнения", ПредопределенноеЗначение("Перечисление.CW_РежимыВыполненияОбработчиков.Отложенно"));
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("РегистрСведений.CW_ОбработчикиОбновления.ФормаСписка", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеВыполненияНажатие(Элемент)

	Если РасписаниеЗадания = Неопределено Тогда
		РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьИзменениеРасписания", ЭтотОбъект);
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеЗадания);
	Диалог.Показать(ОписаниеОповещения);

КонецПроцедуры      


&НаКлиенте
Процедура ЗавершитьИзменениеРасписания(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеЗадания = РезультатВыполнения;
	ЗаписатьЗаданиеНаСервере();

КонецПроцедуры 

&НаСервере
Процедура ЗаписатьЗаданиеНаСервере()  
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.CW_ОтложенноеВыполнениеОбработчиковОбновления);  
	РегламентноеЗадание.Расписание = РасписаниеЗадания;
	РегламентноеЗадание.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьСейчасНажатие(Элемент)  
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Будут выполнены не выполненные обработчики обновления. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;                                   
	
	МассивКлючей = ПолучитьМассивОбработчиковДляВыполнения(); 
	Если МассивКлючей.Количество() = 0 Тогда  
		ПоказатьПредупреждение(, "Не удалось получить обрабтчики для выполнения!");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("МассивКлючей", МассивКлючей); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыполнениеОбработчиков", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.CW_ОбработчикиОбновления.Форма.ФормаВыполненияОбработчиковОбновления", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры     

&НаСервере
Функция ПолучитьМассивОбработчиковДляВыполнения()  
	
	Массив = Новый Массив;
	
	СтатусыДляВыполнения = Новый Массив;
	СтатусыДляВыполнения.Добавить(ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработчиковОбновления.НеВыполнялся"));
	СтатусыДляВыполнения.Добавить(ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработчиковОбновления.Ошибка"));
	СтатусыДляВыполнения.Добавить(ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработчиковОбновления.Приостановлен"));

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбработчикиОбновления.ИмяОбработчика КАК ИмяОбработчика
	               |ИЗ
	               |	РегистрСведений.CW_ОбработчикиОбновления КАК CW_ОбработчикиОбновления
	               |ГДЕ
	               |	CW_ОбработчикиОбновления.РежимВыполнения = ЗНАЧЕНИЕ(Перечисление.CW_РежимыВыполненияОбработчиков.Отложенно)
	               |	И CW_ОбработчикиОбновления.Статус В (&СтатусыДляВыполнения)";
	
	Запрос.УстановитьПараметр("СтатусыДляВыполнения", СтатусыДляВыполнения);    
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Ключ = Новый Структура("ИмяОбработчика", Выборка.ИмяОбработчика);
		Массив.Добавить(Ключ);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыполнениеОбработчиков(РезультатВыплнения, ДополнительныеПараметры) Экспорт  
	
	Если ТипЗнч(РезультатВыплнения) <> тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПолучениеИнформации;
	ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания", 0.1, Истина);
	
	Если РезультатВыплнения.Ошибка Тогда 
		ПоказатьПредупреждение(, "В процессе выполнения обработчиков возникли ошибки.
								 |Подробно см. журнал регистрации");
	ИначеЕсли РезультатВыплнения.ТребуетсяПерезапуск Тогда  
		ПоказатьПредупреждение(, "Для продолжения работы необходимо выполнить перезапуск программы!");	
	КонецЕсли;  
	
КонецПроцедуры
